#+title: Autogen Assistant


* NO Autogen fails to read stuff from duckduckgo...
<2025-01-28 wto>
** LLM setup

#+BEGIN_SRC python :session autogen_assistant.org  :exports both
import os

with open("/home/kuba/.keys/anthropic_key.txt") as f:
    os.environ["ANTHROPIC_API_KEY"] = f.read().strip()

config_list = [
    {
        "model": "claude-3-5-sonnet-20240620",
        "api_type": "anthropic",
    }
]
llm_config = {
    "timeout": 600,
    "cache_seed": 42,
    "config_list": config_list,
    "temperature": 0,
}
#+END_SRC

** Helper functions

#+BEGIN_SRC python :session autogen_assistant.org  :exports both
import json
from typing import Annotated, Dict, Any
from duckduckgo_search import DDGS

def ddg_search(query: Annotated[str, "search engine query"], max_results: int=10) -> Dict[str, Any]:
    with DDGS() as ddgs:
        results = [r for r in ddgs.text(query, max_results=max_results)]
        if results:
            return results
        else:
            return {"error": "No results found"}


#+END_SRC

#+RESULTS:


#+BEGIN_SRC python :session autogen_assistant.org  :exports both
#+END_SRC

#+RESULTS:
| title | : | Query Definition & Meaning - Merriam-Webster                        | href                                             | :    | https://www.merriam-webster.com/dictionary/query                    | body                                                                | :    | The meaning of QUERY is question, inquiry. How to use query in a sentence. Synonym Discussion of Query. question, inquiry; a question in the mind : doubt; question mark… See the full definition. Games; Word of the Day; Grammar; Wordplay; Rhymes; Word Finder; Thesaurus; Join MWU; More. Games; Word of the Day; Grammar; |                                                                     |
| title | : | jQuery                                                              | href                                             | :    | https://jquery.com/                                                 | body                                                                | :    | jQuery is a fast, small, and feature-rich JavaScript library that simplifies HTML document traversal, event handling, animation, and Ajax. Learn more about jQuery, download the latest version, and browse the API documentation and plugins. |                                                                     |
| title | : | Query - definition of query by The Free Dictionary                  | href                                             | :    | https://www.thefreedictionary.com/query                             | body                                                                | :    | Define query. query synonyms, query pronunciation, query translation, English dictionary definition of query. n. pl. que·ries 1. A question; an inquiry. 2. A doubt in the mind; a mental reservation. 3. A notation, usually a question mark, calling attention to an... |                                                                     |
| title | : | QUERY definition in American English                                | Collins English Dictionary                       | href | :                                                                   | https://www.collinsdictionary.com/us/dictionary/english/query       | body | :                                                                   | A query is a question, especially one that you ask an organization, publication, or expert. If you have any queries about this insurance, please contact our call center. 2. transitive verb. If you query something, you check it by asking about it because you are not sure if it is correct. |
| title | : | QUERY                                                               | English meaning - Cambridge Dictionary           | href | :                                                                   | https://dictionary.cambridge.org/dictionary/english/query           | body | :                                                                   | QUERY definition: 1. a question, often expressing doubt about something or looking for an answer from an authority…. Learn more. |
| title | : | QUERY                                                               | definition in the Cambridge English Dictionary   | href | :                                                                   | https://dictionary.cambridge.org/us/dictionary/english/query        | body | :                                                                   | Query is a noun or verb that means a question, often expressing doubt or looking for information. Learn how to use query in different contexts, such as business, law or search engines, and see synonyms and related words. |
| title | : | Query - Definition, Meaning & Synonyms - Vocabulary.com             | href                                             | :    | https://www.vocabulary.com/dictionary/query                         | body                                                                | :    | A query is a question, or the search for a piece of information. Other forms: queried; queries; querying A query is a question, or the search for a piece of information.. The Latin root quaere means "to ask" and it's the basis of the words inquiry, question, quest, request, and query.Query often fits the bill when referring to Internet searches, polite professional discourse, and subtle pleas. |                                                                     |
| title | : | QUERY                                                               | definition in the Cambridge Learner's Dictionary | href | :                                                                   | https://dictionary.cambridge.org/us/dictionary/learner-english/query | body | :                                                                   | QUERY meaning: 1. a question: 2. to ask questions in order to check that something is true or correct: . Learn more. |
| title | : | Query Definition & Meaning                                          | Britannica Dictionary                            | href | :                                                                   | https://www.britannica.com/dictionary/query                         | body | :                                                                   | QUERY meaning: a question or a request for information about something |
| title | : | query verb - Definition, pictures, pronunciation and usage notes ... | href                                             | :    | https://www.oxfordlearnersdictionaries.com/definition/english/query_2 | body                                                                | :    | query somebody (especially North American English) I queried a few people on the subject. Word Origin mid 17th cent.: anglicized form of the Latin imperative quaere! , used in the 16th cent. in English as a verb in the sense 'inquire' and as a noun meaning 'query', from Latin quaerere 'ask, seek'. |                                                                     |

#+BEGIN_SRC python :session autogen_assistant.org  :exports both
helper_functions = [
    {  "name": "web_search",
       "function": ddg_search,
       "description": "web search with duckduckgo"
   }
]
#+END_SRC

#+RESULTS:

** Simple agent setup

#+BEGIN_SRC python :session autogen_assistant.org  :exports both
import autogen

assistant = autogen.AssistantAgent(
    name="assistant",
    llm_config=llm_config,
    system_message="""
        You are a coding architect's assistant. You help with general questions about programming, for example finding out what repositories
        would be useful for implementing a given feature.
        You should use web search to back up your answers.
        When you use web search try to annotate the specific information with sources that were provided in 'title' key
        from the web search
    """

)
# create a UserProxyAgent instance named "user_proxy"
user_proxy = autogen.UserProxyAgent(
    name="user_proxy",
    human_input_mode="NEVER",
    max_consecutive_auto_reply=3,
    is_termination_msg=lambda x: x.get("content", "").rstrip().endswith("TERMINATE"),
    code_execution_config={
        "work_dir": "web",
        "use_docker": False,
    },  # Please set use_docker=True if docker is available to run the generated code. Using docker is safer than running the generated code directly.
    llm_config=llm_config,
    system_message="""Reply TERMINATE if the task has been solved at full satisfaction.
Otherwise, reply CONTINUE, or the reason why the task is not solved yet. Be on point and try not to be verbose, and use straightforward replies. If you decide to continue spell out the reason""",
)

for helper_function_info in helper_functions:
    assistant.register_for_llm(name=helper_function_info["name"], description=helper_function_info["description"])(helper_function_info["function"])

    user_proxy.register_for_execution(name=helper_function_info["name"])(helper_function_info["function"])
#+END_SRC

#+RESULTS:

*** Utils
Callback for registering replies in a file (WTF is this so hard and not enabled in a parameter?)

#+BEGIN_SRC python :session autogen_assistant.org  :exports both
log_file = "basic_coding_helper.log"
def log_message(recipient, messages, sender, config):
    if "callback" in config and  config["callback"] is not None:
        callback = config["callback"]
        callback(sender, recipient, messages[-1])
    with open(log_file, "w+") as f:
        f.write(json.dumps({"recipient": recipient.name, "messages": messages}))
    return False, None  # required to ensure the agent communication flow continues

for agent in [user_proxy, assistant]:
    agent.register_reply(
        [autogen.Agent, None],
        reply_func=log_message,
        config={"callback": None}
    )
#+END_SRC

#+RESULTS:

*** Examples

#+BEGIN_SRC python :session autogen_assistant.org  :exports both :async
n_items = 10

chat_result = user_proxy.initiate_chat(
    assistant,
    message=f"""What is the output format used by Weaviate for search results?""",
)

#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session autogen_assistant.org  :exports both :results output
print(json.dumps(chat_result.chat_history[-2], indent=4))
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session autogen_assistant.org  :exports both
n_items = 10

chat_result = user_proxy.initiate_chat(
    assistant,
    message=f"""What are some github repositories that implement GraphRAG? Show me {n_items} examples""",
)
#+END_SRC


#+BEGIN_SRC python :session autogen_assistant.org  :exports both :async
n_items = 10

chat_result = user_proxy.initiate_chat(
    assistant,
    message=f"""Find out the performance of OpenAI, Cohere and Anthropic models on HumanEval and MBPP starting from 2022 (probably their leaderboards are a good starting point). Write Python script that will put this data on a scatterplot.""",
)
#+END_SRC
